# Визначити чи є введене з клавіатури число простим

N = int(input("N = "))
# число просте, якщо воно ділиться лише на себе і 1,
# при цьому 1 не є простим числом
# 5 - просте, бо його дільники лише 1 і 5
# 6 - не просте, бо крім 1 та 6 воно ще має дільники 2 і 3
# Отже, щоб перевірити, що число є простим
# треба ділити задане число на всі числа починаючи від 2 закінчуючи N-1 і
# якщо воно хоч раз поділиться без остачі, то число не є простим

i = 2
isPrime = True
while i < N:

    if N % i == 0:
        isPrime = False
        print("змінюємо isPrime")
        break

    i += 1

if isPrime:
    print("Число просте")
else:
    print("Число не просте")