N = int(input())
i = 2

while i < int(N ** 0.5) + 1: # рахуємо до кореня з числа
    # print(i, end=" ")
    if N % i == 0:
        print(0)
        break
    i += 1
else:
    print(1)

# 13
# 2 3 4 5 6 7 8 9 10 11 12
# 26
# 2 3 4 5 6 7 8 9 10 11 12 13 14 .. 25

# N, N**0.5 : p * p == N
# Хочемо довести, що, якщо наше число не є простим,
# то обов'язково один з його дільників міститься
# у проміжку від 2 до N**0.5
# Від супротивного, припустимо, що це не так і всі
# дільники більші за N**0.5. Тоді беремо два довільних
# дільники нашого числа наприклад p1, p2 > N**0.5
# отримуємо суперечність бо p1 * p2 > N
